package com.example.backend.Util;

import java.util.List;

public class DefaultRecallQuestions {

    public static final List<String> DEFAULT_QUESTIONS;

    static {
        DEFAULT_QUESTIONS = List.of(
//                "고향은 어디인가요?",
//                "배우자 이름은 무엇인가요?",
//                "가족/인적사항은 어떻게 되나요?",
//                "첫 회사는 어디인가요?",
//                "할 줄 아는 운동은 무엇인가요?",
//                "가장 잘 하는 요리는 무엇인가요?",
//                "좋아하는 음식은 무엇인가요?",
//                "가장 좋아하는 계절은 언제인가요?",
//                "가훈이나 좌우명이 있나요?",
//                "가지고 계신 알러지가 있나요?",
//                "가장 좋아하는 가수는 누구인가요?",
//                "몇째로 태어나셨나요?",
//                "동물을 키운다면 이름은 무엇인가요?",
//                "싫어하거나 못 드시는 음식이 있나요?",
//                "평생 가장 오래 몸담았던 직업의 명칭은 무엇인가요?",
//                "지금 대통령의 이름은 누구인가요?",
//                "지금 살고 계신 집은 몇 층인가요?",
//                "즐겨보는 TV프로그램은 무엇인가요?",
//                "본인의 띠는 무엇인가요? (예: 토끼띠, 쥐띠)",
//                "혈액형은 무엇인가요?",
//                "가장 보고싶은 사람의 이름은 무엇인가요?",
//                "아파트, 주택, 빌라 중 어디에 거주하시나요?",
//                "평소 일상이나 루틴이 어떻게 되시나요?",
//                "자녀분들 이름이 어떻게 되나요?",
//                "손자/손녀가 있으신가요? 이름이 무엇인가요?",
//                "아버지/어머니 성함은 어떻게 되시나요?"
        );
    }
}